#파이썬에서는 문자열과 숫자로 구분 할 수 있습니다
# 단일 문자들이 합쳐서 하나의 문장을 이루는 것을 문자열이라고 합니다
#문자열 같은 경우 반드시 "" 혹은 '' 안에 들어있습니다
#print("안녕하세요")
#C언어는 ""만 사용해야 합니다

#print("2" + "2")
#문자열 + 문자열은 서로 다른 문자열이 붙어서 나온다
#print('안녕'+'하세요')
#숫자는 ""나 ''없이 그냥 숫자만 입력
#문자열+숫자는 불가능 합니다
#print("2"+2)


#print 함수 - 표준 출력 함수로서 사용자가 입력한 값의 결과를 출력해주는 기능을 가지고 있는함수
#print 함수는 문법에 문제가 없다면 문자열과 숫자 모두 출력 가능
#print("hi")
#print(123)

#print("안녕","하세요")

#print(1,"+",1,"=",2)
#,를 사용해서 문자열과 숫자를 구별해서 출력하는것이 가능합니다

#print 함수 안에 """ 혹은 '''를 사용해서 하나의 print에 여러줄의 문장 입력 가능
#print('''hello 
#my name 
#is an''')

# print("===========")
# print("영수증")
# print("===========")
# print("""피카츄   :   20000원
# 꼬부기   :   30000원
# 파이리   :   40000원
# 총합     :   90000원""")

# print('"안녕하세요"라고 말했다')
# print('"안녕하세요"'+'라고 말했다')
#문자열에 ''나""를 사용하고 싶은 경우
#print(""""안녕하세요"라고 말했다""")

#숫자형

#정수형-0,1,2,-1,-2등등

#실수형 : 3.14, -1.2 ,0,1,3.0 등등

#사칙연산 : +,-,*,/등등 사용
# print(10+20)
# print(3.14+1.1)
#print(10+3.14)

# print(20-10)
# print(10-20)

#python에서 곱하기는 *를 사용
#print(10*10)
#**는 제곱연산자라고 합니다  x**y = x를 y만큼 제곱
#print(2**4)
#print('hello'*3)
#문자열 * 숫자 형태로 사용 할 수 있습니다

#python에서 나누기는 /,//,%를 사용합니다
#print(9/2)
#print(9//2)
#//는 몫에 해당하는 값입니다
#print(9%2)
#%는 나머지가 나오는 결과가 나옵니다

# print('국어점수 :',80)
# print('영어점수 :',70)
# print('수학점수 :',60)
# print('총점 :',80+70+60)
# print('평균 :',(80+70+60)//3)

#숫자형의 함수

#1. 진수 변환 함수
#이진법
#0,1을 숫자로 표현하는 방식
#십진법
#0~9까지의 숫자로 표현하는 방식
#16진법
#0~9 그리고 A~F까지 사용해서 숫자로 표현

# print(0b100) #0b는 이진수를 뜻하고 이진수를 십진수로 변환
# print(0o100) #0o는 8진수를 뜻하고 8진수를 십진수로 변환
# print(0x100) #0x는 16진수를 뚯하고 16진수를 십진수로 변환

# print(bin(4)) #bin()는 10진수를 이진수로 변환
# print(oct(64)) #oct()는 10진수를 8진수로 변환
# print(hex(256)) #hex()sms 10진수를 16진수로 변환