#서식문자를 다수 사용하는 경우
# 서식문자의 갯수 만큼 반드시 해당하는 값의 갯수도 똑같아야 합니다
#print("%d + %d = %d"%(10,10,10+10))
#print("%d + %d = %d"%(10,10))#error
#print("%d + %d"%(10,10,10+10))#error

#format 형식으로 사용하는 방법
#print("{} + {} = {}".format(10,10,10+10))


# %f
# 실수형태의 자료를 사용하고 싶을 때 사용하는 서식 문자
# %f만 사용하면 기본적으로 소수점 6자리 까지 자동으로 출력을 합니다
#print("나의 키는 %f 입니다"%175.5)
# %와 f 사이에 .숫자 를 입력하면 입력한 숫자만큼 소수점 자리를 표시합니다
#print("나의 키는 %.1f 입니다"%175.5)
#print("나의 키는 %f 입니다"%175)#잘못된 결과

#format형식으로 사용하는 방법
# print("나의 키는 {} 입니다".format(175.5))
# print("나의 키는 {:f} 입니다".format(175.5))
#print("나의 키는 {:.1f} 입니다".format(175.5))

#%s
#%s는 문자열의 값을 사용하고 싶을 때 사용하는 서식문자 입니다
#print("내가 사는 곳은 %s이다"%"서울")

#format 형식으로 사용하는 방법
#print("내가 사는 곳은 {}이다".format("서울"))

#%c
#%c는 단일문자를 표현하고 싶을 때 사용하는 문자입니다
#print("AB%c"%"C")
#print("AB%c"%"CD") #error
#%c에 정수값을 넣으면 그 값에 해당하는 단일문자를 출력합니다
#print("%c"%65) #A라는 결과가 출력(아스키코드표 참고)
#아스키코드는 문자 또는 특수문자 등 컴퓨터 효율적으로 처리하기 위해 만든 코드입니다

#format 형식으로 사용
#print("AB{}". format("C"))

#출력결과
#2019년 9월 20일 12.00
#조건 (2019=정수, 년=문자열, 9월=문자열, 20일=문자열,12.00=실수로 사용)
# print("%d%s %s %s %.2f"%(2019,"년","9월","20일",12.00))
# print("{}{} {} {} {:.2f}".format(2019,"년","9월","20일",12.00))
# 매우 중요

#서식문자를 사용한 정렬방식
#print("|%10s|,|%-10s|"%("오른쪽 정렬","왼쪽 정렬"))#(|는 굳이 쓸 필요X)
#print("%10d"%1000)
#print("|{:>10}|,|{:<10}|".format("오른쪽정렬","왼쪽정렬"))
#print("|{:^10}|".format("가운데 정렬"))

#천 단위의 구분자(,) 삽입
# print("{:,}".format(1000000))
# print("{:.}".format(1000000))#error

#변수(매우 중요)
#값을 저장 할 수 있는 공간
#변수는 반드시 변수의 이름이 있어야 사용 할 수 있습니다
#변수는 사용 할 때는 반드시 변수의 선언과 초기와를 해야 사용이 가능합니다

#파이썬에서 변수 선언 및 초기화
# a = 10 #변수의 선언과 초기화 #초기화(10에서 a로 초기화 한다는 의미)
# print(a)
#C언어 에서의 변수 선언 및 초기화
# int a ; #변수의 선언
# a = 10; #변수의 초기화
# print("%d",a);

#변수를 선언 할 때 코드의 순서를 확인해서 작성해야 한다
#변수를 사용 할 때 반드시 선언과 초기화가 먼저 입력이 되어야 한다
#print(a) #error
#a = 10 

#변수의 사용 이유
# money = 1500
# print("아이스크림은 %d원 입니다"%money)
# print("아이스크림은 %d원 입니다"%money)
# print("아이스크림은 %d원 입니다"%money)
# print("아이스크림은 %d원 입니다"%money)
# print("아이스크림은 %d원 입니다"%money)

#변수의 사용형식
#1. 변수명 = 값
#     a = 10

#2. 변수명1 = 변수명2 = 값1
#a = b = 10
#print(a);print(b)

#3. 변수명1,변수명2 = 값1,값2
# a,b = 10,20
# print(a);print(b)

#초기화의 의미 - null값의 존재 때문
# a = 10
# print(a)
# a = 20
# print(a)

#변수 생성시 작명 규칙
#알파벳,숫자,언더스코어(_)로 구성을 합니다
#알파벳은 대소문자를 구별합니다
# a = 10
# A = 20
# print(a);print(A)
# 변수명의 시작은 숫자를 사용 할 수 없습니다
#1a = 10
#print(1a)
#변수이름의 시작이 숫자만 아니라면 숫자를 사용 할 수 있습니다
#a1 = 10
#print(a1)
#공백이나 특수문자를 사용 할 수 없습니다
# a! a = 10
# print(a! a) #error
# a_a = 10
# print(a_a)
#변수명은 한글로 사용 가능합니다
# 국어 = 80
# print(국어)
# 변수명은 가능한한 짧고 간결하게 
#05변수의 자료형